andrade824/STM32F7-Drivers/platform/stm32f7_registers.h
/* Legacy define */
#define  I2C_CR1_DFN                         I2C_CR1_DNF                   /*!< Digital noise filter                */

/******************  Bit definition for I2C_CR2 register  ********************/
#define  I2C_CR2_SADD                        0x000003FFU        /*!< Slave address (master mode)                             */
#define  I2C_CR2_RD_WRN                      0x00000400U        /*!< Transfer direction (master mode)                        */
#define  I2C_CR2_ADD10                       0x00000800U        /*!< 10-bit addressing mode (master mode)                    */
#define  I2C_CR2_HEAD10R                     0x00001000U        /*!< 10-bit address header only read direction (master mode) */
#define  I2C_CR2_START                       0x00002000U        /*!< START generation                                        */
#define  I2C_CR2_STOP                        0x00004000U        /*!< STOP generation (master mode)                           */
#define  I2C_CR2_NACK                        0x00008000U        /*!< NACK generation (slave mode)                            */
#define  I2C_CR2_NBYTES                      0x00FF0000U        /*!< Number of bytes                                         */
#define  I2C_CR2_RELOAD                      0x01000000U        /*!< NBYTES reload mode                                      */
#define  I2C_CR2_AUTOEND                     0x02000000U        /*!< Automatic end mode (master mode)                        */
#define  I2C_CR2_PECBYTE                     0x04000000U        /*!< Packet error checking byte                              */

/*******************  Bit definition for I2C_OAR1 register  ******************/
#define  I2C_OAR1_OA1                        0x000003FFU        /*!< Interface own address 1   */
#define  I2C_OAR1_OA1MODE                    0x00000400U        /*!< Own address 1 10-bit mode */
#define  I2C_OAR1_OA1EN                      0x00008000U        /*!< Own address 1 enable      */

/*******************  Bit definition for I2C_OAR2 register  ******************/
#define  I2C_OAR2_OA2                        0x000000FEU        /*!< Interface own address 2 */
#define  I2C_OAR2_OA2MSK                     0x00000700U        /*!< Own address 2 masks     */
#define  I2C_OAR2_OA2NOMASK                  0x00000000U        /*!< No mask */
#define  I2C_OAR2_OA2MASK01                  0x00000100U        /*!< OA2[1] is masked, Only OA2[7:2] are compared */
#define  I2C_OAR2_OA2MASK02                  0x00000200U        /*!< OA2[2:1] is masked, Only OA2[7:3] are compared */
#define  I2C_OAR2_OA2MASK03                  0x00000300U        /*!< OA2[3:1] is masked, Only OA2[7:4] are compared */
#define  I2C_OAR2_OA2MASK04                  0x00000400U        /*!< OA2[4:1] is masked, Only OA2[7:5] are compared */
#define  I2C_OAR2_OA2MASK05                  0x00000500U        /*!< OA2[5:1] is masked, Only OA2[7:6] are compared */
#define  I2C_OAR2_OA2MASK06                  0x00000600U        /*!< OA2[6:1] is masked, Only OA2[7] are compared */
#define  I2C_OAR2_OA2MASK07                  0x00000700U        /*!< OA2[7:1] is masked, No comparison is done */
#define  I2C_OAR2_OA2EN                      0x00008000U        /*!< Own address 2 enable    */

/*******************  Bit definition for I2C_TIMINGR register *******************/
#define  I2C_TIMINGR_SCLL                    0x000000FFU        /*!< SCL low period (master mode)  */
#define  I2C_TIMINGR_SCLH                    0x0000FF00U        /*!< SCL high period (master mode) */
#define  I2C_TIMINGR_SDADEL                  0x000F0000U        /*!< Data hold time                */
#define  I2C_TIMINGR_SCLDEL                  0x00F00000U        /*!< Data setup time               */
#define  I2C_TIMINGR_PRESC                   0xF0000000U        /*!< Timings prescaler             */

/******************* Bit definition for I2C_TIMEOUTR register *******************/
#define  I2C_TIMEOUTR_TIMEOUTA               0x00000FFFU        /*!< Bus timeout A                 */
#define  I2C_TIMEOUTR_TIDLE                  0x00001000U        /*!< Idle clock timeout detection  */
#define  I2C_TIMEOUTR_TIMOUTEN               0x00008000U        /*!< Clock timeout enable          */
#define  I2C_TIMEOUTR_TIMEOUTB               0x0FFF0000U        /*!< Bus timeout B                 */
#define  I2C_TIMEOUTR_TEXTEN                 0x80000000U        /*!< Extended clock timeout enable */

/******************  Bit definition for I2C_ISR register  *********************/
#define  I2C_ISR_TXE                         0x00000001U        /*!< Transmit data register empty    */
#define  I2C_ISR_TXIS                        0x00000002U        /*!< Transmit interrupt status       */
#define  I2C_ISR_RXNE                        0x00000004U        /*!< Receive data register not empty */
#define  I2C_ISR_ADDR                        0x00000008U        /*!< Address matched (slave mode)    */
#define  I2C_ISR_NACKF                       0x00000010U        /*!< NACK received flag              */
#define  I2C_ISR_STOPF                       0x00000020U        /*!< STOP detection flag             */
#define  I2C_ISR_TC                          0x00000040U        /*!< Transfer complete (master mode) */
#define  I2C_ISR_TCR                         0x00000080U        /*!< Transfer complete reload        */
#define  I2C_ISR_BERR                        0x00000100U        /*!< Bus error                       */
#define  I2C_ISR_ARLO                        0x00000200U        /*!< Arbitration lost                */
#define  I2C_ISR_OVR                         0x00000400U        /*!< Overrun/Underrun                */
#define  I2C_ISR_PECERR                      0x00000800U        /*!< PEC error in reception          */
#define  I2C_ISR_TIMEOUT                     0x00001000U        /*!< Timeout or Tlow detection flag  */
#define  I2C_ISR_ALERT                       0x00002000U        /*!< SMBus alert                     */
#define  I2C_ISR_BUSY                        0x00008000U        /*!< Bus busy                        */
#define  I2C_ISR_DIR                         0x00010000U        /*!< Transfer direction (slave mode) */
#define  I2C_ISR_ADDCODE                     0x00FE0000U        /*!< Address match code (slave mode) */

/******************  Bit definition for I2C_ICR register  *********************/
#define  I2C_ICR_ADDRCF                      0x00000008U        /*!< Address matched clear flag      */
#define  I2C_ICR_NACKCF                      0x00000010U        /*!< NACK clear flag                 */
#define  I2C_ICR_STOPCF                      0x00000020U        /*!< STOP detection clear flag       */
#define  I2C_ICR_BERRCF                      0x00000100U        /*!< Bus error clear flag            */
#define  I2C_ICR_ARLOCF                      0x00000200U        /*!< Arbitration lost clear flag     */
#define  I2C_ICR_OVRCF                       0x00000400U        /*!< Overrun/Underrun clear flag     */
#define  I2C_ICR_PECCF                       0x00000800U        /*!< PAC error clear flag            */
#define  I2C_ICR_TIMOUTCF                    0x00001000U        /*!< Timeout clear flag              */
#define  I2C_ICR_ALERTCF                     0x00002000U        /*!< Alert clear flag                */

